#include <iostream>
#include <fstream>
#include <string>

int main() {
	std::ifstream inpt;	///Поток за четене от файла
	std::ofstream outp; ///Поток за запис във файла

	///Връзваме потока за вход със файла, който се намира в директорията на проекта
	///Прилагаме флага за изчистване на файла. Ако такъв файл няма то ще бъде създаден
	outp.open("example.txt", std::ostream::trunc);

	///Записваме символен низ във файла
	outp << "Hello World!, again";

	//outp.flush(); използвайте flush() ако потока искате да работите още с потока, за да запишете промените във файла на вашия диск
	outp.close(); ///Когато затворите файла, промените направени от програмата ще се отразят във файла на вашия диск

	///Връзваме потока за четене със файла, тук ако файла го нямаше на това място във файловата система
	///нямаше да го създаде този път. Файл се създава само ако е приложен флага за запис (out) или за чистена на файла (trunc)
	inpt.open("example.txt"); 
	
	///Създаваме си низ, с който ще запазваме прочетеното от файла
	std::string text;
	
	///Първо ще разгледаме форматираното извличане на информация от файла
	///То работи на същия принцип както и при cin. Ще извлече цялата информация 
	///докато не стигне до знак ' ' или '\n' и ще провери дали може да преобразува
	///информацията към типа подаден от дясно. Тъй като използваме низ то няма да 
	///настъпи проблем
	std::cout << "Word by word:\n";
	
	///Цикъла ще се изпълни докато не се стигне до края на файла или не се появи грешка в потока
	while (inpt >> text)std::cout << text << std::endl;
	std::cout << std::endl;

	///Понеже е достигнат края на потока трябва да занулим флаговете, за да може да продължим да ползваме потока
	inpt.clear();
	///Връщаме си указателя за четене от файла в началото
	inpt.seekg(0, std::istream::beg);

	///Сега с getline ще вземем цял ред от файла
	getline(inpt, text);
	std::cout <<"Whole line: "<< text << std::endl;

	///Тук не е нужно да затваряме файла и да освобождаваме потока, тъй като програмата ше спре и само ще се 
	///освободи, но е по-коректно (кой знае кога ще ми хрумне да добавя код преди края и после да се чудя зашо нещо се е счупило. пазете се от себе си :D)
	inpt.close();
}
