/**
	 Примерна програма реализираща Bigint класа, който може да
	 поддържа по-големи стойности като цели числа. В решения пример
	 са реализирани само събиране с цели положителни числа, голямата 
	 четворка и оператори за вход и изход от поток. Имайте предвит, че
	 и тази реализация нещата пак могат да се счупят, защото пазим
	 размера в променлива и така си ограничаваме размера. Препоръчвам
	 ви да си помислите как бихте се справили с този проблем.
*/

#include <iostream>
#include "src/Bigint.h"
using namespace std;

int main() {
	Bigint BI1, BI2;


	/// Пример ако въведем две числа и да изведем техния сбор
	std::cin >> BI1;
	std::cin >> BI2;
	std::cout << BI1+BI2;

	int times;
	///Въвеждаме колко пъти искаме да съберем едно число и след това числото, демек реализация на умножение на две числа
	std::cin >> times;
	std::cin >> BI1;

	Bigint res = BI1;

	for (int i = 1; i < times; i++) {
		res = res + BI1;
	}

	std::cout << res;
}