#include <iostream>
using namespace std;

const int MAX_LEN = 100;

int len(char* ptr){
    ///Въвеждаме брояч, който да отброява текущия размер на символния низ
    ///Този брояч ще ни служи и за да помним на коя позиция в масива сме стигнали
    int result = 0;

    ///Докато не срещнем края на символния низ (терминиращата нула)
    ///Увеличваме брояча
    while(ptr[result] != '\0'){
        result++;
    }

    return result;
}

int main(){
    ///Създаваме си указател към char и му записваме адреса върнат от new
    ///където сме заделили паметта за масива
    char* inpt = new char[MAX_LEN];


    cout<<"Enter a string (max length "<<MAX_LEN-1<<"): ";
    /**
        Понеже искаме да въведем символен низ използваме cin.getline(), на
        който подаваме къде да запише въведения низ и с каква максимална дължина
        В случая понеже масива е с дължина MAX_LEN и трябва да запишем терминиращи символ
        ще имаме най-голяма дължина на низа MAX_LEN - 1
    */
    cin.getline(inpt, MAX_LEN);

    cout<<len(inpt)<<endl;

}
